
## Plan Result (demo)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]
  * module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0]
* Update
  * azurerm_key_vault_secret.appInsights-InstrumentationKey
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appInsights-InstrumentationKey will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appInsights-InstrumentationKey" {
        id                      = "https://recipes-sds-kv-demo.vault.azure.net/secrets/appInsights-InstrumentationKey/35a1839b20bc4c01bcddc54559c63cbc"
        name                    = "appInsights-InstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "a20f56a1-8b57-4218-84d5-a33d21b10efd" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ id                                    = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/recipes-shared-infrastructure-demo/providers/Microsoft.Insights/components/recipes-demo" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "recipes-demo" -> "recipes-sds-demo" # forces replacement
        tags                                  = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/recipes-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "demo"
            "managedBy"           = "Platform Operations"
        }
        # (13 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Monitors for application insight reaching it's daily cap."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "uksouth"
      + name                                   = "Application Insights daily cap reached - recipes-sds-demo"
      + resource_group_name                    = "recipes-shared-infrastructure-demo"
      + scopes                                 = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod",
        ]
      + severity                               = 4
      + tags                                   = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/recipes-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "demo"
          + "managedBy"           = "Platform Operations"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups     = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts",
            ]
          + custom_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C05KAG00K1N"
            }
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = (known after apply)
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0] will be created
  + resource "null_resource" "fix_scheduled_query_rules_alert_v2" {
      + id       = (known after apply)
      + triggers = {
          + "alert_id" = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->